# **1. Perkenalan Dataset**

Tahap pertama, Anda harus mencari dan menggunakan dataset dengan ketentuan sebagai berikut:

1. **Sumber Dataset**:  
   Dataset dapat diperoleh dari berbagai sumber, seperti public repositories (*Kaggle*, *UCI ML Repository*, *Open Data*) atau data primer yang Anda kumpulkan sendiri.

# **2. Import Library**

Pada tahap ini, Anda perlu mengimpor beberapa pustaka (library) Python yang dibutuhkan untuk analisis data dan pembangunan model machine learning atau deep learning.

In [1]:
#Type your code here
import os
import re
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler, OneHotEncoder

# **3. Memuat Dataset**

Pada tahap ini, Anda perlu memuat dataset ke dalam notebook. Jika dataset dalam format CSV, Anda bisa menggunakan pustaka pandas untuk membacanya. Pastikan untuk mengecek beberapa baris awal dataset untuk memahami strukturnya dan memastikan data telah dimuat dengan benar.

Jika dataset berada di Google Drive, pastikan Anda menghubungkan Google Drive ke Colab terlebih dahulu. Setelah dataset berhasil dimuat, langkah berikutnya adalah memeriksa kesesuaian data dan siap untuk dianalisis lebih lanjut.

Jika dataset berupa unstructured data, silakan sesuaikan dengan format seperti kelas Machine Learning Pengembangan atau Machine Learning Terapan

In [2]:
#Type your code here
data1 = pd.read_csv("./data/train.csv")
data2 = pd.read_csv("./data/test.csv")
data = pd.concat([data1, data2], ignore_index=True)
data

/var/folders/ys/zpf8mfkn7nl27dx45g8gqpdr0000gn/T/ipykernel_22925/1440548333.py:2: DtypeWarning: Columns (26) have mixed types. Specify dtype option on import or set low_memory=False.
  data1 = pd.read_csv("./data/train.csv")

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,0x25fe5,CUS_0x8600,December,Sarah McBridec,4975,031-35-0942,Architect,20002.88,1929.906667,10,...,_,3571.7,34.780553,NaN,Yes,60.964772,146.48632477751087,Low_spent_Small_value_payments,275.53956951573343,NaN
149996,0x25fee,CUS_0x942c,September,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,31 Years and 11 Months,NM,35.104023,181.44299902757518,Low_spent_Small_value_payments,409.39456169535066,NaN
149997,0x25fef,CUS_0x942c,October,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,32 Years and 0 Months,No,35.104023,__10000__,Low_spent_Large_value_payments,349.7263321025098,NaN
149998,0x25ff0,CUS_0x942c,November,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,32 Years and 1 Months,No,35.104023,97.59857973344877,High_spent_Small_value_payments,463.23898098947717,NaN
149999,0x25ff1,CUS_0x942c,December,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,_,502.38,34.108530,32 Years and 2 Months,No,35.104023,220.45787812168732,Low_spent_Medium_value_payments,360.37968260123847,NaN

In [3]:
data.tail()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
149995,0x25fe5,CUS_0x8600,December,Sarah McBridec,4975,031-35-0942,Architect,20002.88,1929.906667,10,...,_,3571.7,34.780553,NaN,Yes,60.964772,146.48632477751087,Low_spent_Small_value_payments,275.53956951573343,NaN
149996,0x25fee,CUS_0x942c,September,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,31 Years and 11 Months,NM,35.104023,181.44299902757518,Low_spent_Small_value_payments,409.39456169535066,NaN
149997,0x25fef,CUS_0x942c,October,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,32 Years and 0 Months,No,35.104023,__10000__,Low_spent_Large_value_payments,349.7263321025098,NaN
149998,0x25ff0,CUS_0x942c,November,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,32 Years and 1 Months,No,35.104023,97.59857973344877,High_spent_Small_value_payments,463.23898098947717,NaN
149999,0x25ff1,CUS_0x942c,December,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,_,502.38,34.108530,32 Years and 2 Months,No,35.104023,220.45787812168732,Low_spent_Medium_value_payments,360.37968260123847,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        150000 non-null  object
 1   Customer_ID               150000 non-null  object
 2   Month                     150000 non-null  object
 3   Name                      135000 non-null  object
 4   Age                       150000 non-null  object
 5   SSN                       150000 non-null  object
 6   Occupation                150000 non-null  object
 7   Annual_Income             150000 non-null  object
 8   Monthly_Inhand_Salary     127500 non-null  float64
 9   Num_Bank_Accounts         150000 non-null  int64
 10  Num_Credit_Card           150000 non-null  int64
 11  Interest_Rate             150000 non-null  int64
 12  Num_of_Loan               150000 non-null  object
 13  Type_of_Loan              132888 non-null  object
 14  Delay_from_due_date       150000 non-null  int64
 15  Num_of_Delayed_Payment    139500 non-null  object
 16  Changed_Credit_Limit      150000 non-null  object
 17  Num_Credit_Inquiries      147000 non-null  float64
 18  Credit_Mix                150000 non-null  object
 19  Outstanding_Debt          150000 non-null  object
 20  Credit_Utilization_Ratio  150000 non-null  float64
 21  Credit_History_Age        136500 non-null  object
 22  Payment_of_Min_Amount     150000 non-null  object
 23  Total_EMI_per_month       150000 non-null  float64
 24  Amount_invested_monthly   143250 non-null  object
 25  Payment_Behaviour         150000 non-null  object
 26  Monthly_Balance           148238 non-null  object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 32.0+ MB

In [5]:
data.describe(exclude=np.number).T

,count,unique,top,freq
ID,150000,150000,0x1602,1
Customer_ID,150000,12500,CUS_0xd40,12
Month,150000,12,January,12500
Name,135000,10139,Stevex,66
Age,150000,2524,39,4198
SSN,150000,12501,#F%$D@*&8,8400
Occupation,150000,16,_______,10500
Annual_Income,150000,21192,36585.12,24
Num_of_Loan,150000,623,3,21500
Type_of_Loan,132888,6260,Not Specified,2112
Num_of_Delayed_Payment,139500,1058,19,7949
Changed_Credit_Limit,150000,4605,_,3150
Credit_Mix,150000,4,Standard,54858
Outstanding_Debt,150000,13622,1360.45,36
Credit_History_Age,136500,408,17 Years and 11 Months,628
Payment_of_Min_Amount,150000,3,Yes,78484
Amount_invested_monthly,143250,136497,__10000__,6480
Payment_Behaviour,150000,7,Low_spent_Small_value_payments,38207
Monthly_Balance,148238,148224,__-333333333333333333333333333__,15
Credit_Score,100000,3,Standard,53174

# **4. Exploratory Data Analysis (EDA)**

Pada tahap ini, Anda akan melakukan **Exploratory Data Analysis (EDA)** untuk memahami karakteristik dataset.

Tujuan dari EDA adalah untuk memperoleh wawasan awal yang mendalam mengenai data dan menentukan langkah selanjutnya dalam analisis atau pemodelan.

In [6]:
#Type your code here
data.isnull().sum()

ID                              0
Customer_ID                     0
Month                           0
Name                        15000
Age                             0
SSN                             0
Occupation                      0
Annual_Income                   0
Monthly_Inhand_Salary       22500
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                17112
Delay_from_due_date             0
Num_of_Delayed_Payment      10500
Changed_Credit_Limit            0
Num_Credit_Inquiries         3000
Credit_Mix                      0
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age          13500
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      6750
Payment_Behaviour               0
Monthly_Balance              1762
Credit_Score                50000
dtype: int64

In [7]:
data['Credit_Score'].isna().sum()

np.int64(50000)

In [8]:
data.isna().mean()*100

ID                           0.000000
Customer_ID                  0.000000
Month                        0.000000
Name                        10.000000
Age                          0.000000
SSN                          0.000000
Occupation                   0.000000
Annual_Income                0.000000
Monthly_Inhand_Salary       15.000000
Num_Bank_Accounts            0.000000
Num_Credit_Card              0.000000
Interest_Rate                0.000000
Num_of_Loan                  0.000000
Type_of_Loan                11.408000
Delay_from_due_date          0.000000
Num_of_Delayed_Payment       7.000000
Changed_Credit_Limit         0.000000
Num_Credit_Inquiries         2.000000
Credit_Mix                   0.000000
Outstanding_Debt             0.000000
Credit_Utilization_Ratio     0.000000
Credit_History_Age           9.000000
Payment_of_Min_Amount        0.000000
Total_EMI_per_month          0.000000
Amount_invested_monthly      4.500000
Payment_Behaviour            0.000000
Monthly_Balance              1.174667
Credit_Score                33.333333
dtype: float64

# **5. Data Preprocessing**

Pada tahap ini, data preprocessing adalah langkah penting untuk memastikan kualitas data sebelum digunakan dalam model machine learning.

Jika Anda menggunakan data teks, data mentah sering kali mengandung nilai kosong, duplikasi, atau rentang nilai yang tidak konsisten, yang dapat memengaruhi kinerja model. Oleh karena itu, proses ini bertujuan untuk membersihkan dan mempersiapkan data agar analisis berjalan optimal.

Berikut adalah tahapan-tahapan yang bisa dilakukan, tetapi **tidak terbatas** pada:
1. Menghapus atau Menangani Data Kosong (Missing Values)
2. Menghapus Data Duplikat
3. Normalisasi atau Standarisasi Fitur
4. Deteksi dan Penanganan Outlier
5. Encoding Data Kategorikal
6. Binning (Pengelompokan Data)

Cukup sesuaikan dengan karakteristik data yang kamu gunakan yah. Khususnya ketika kami menggunakan data tidak terstruktur.

In [9]:
object_col = data.describe(include='O').columns
object_col

Index(['ID', 'Customer_ID', 'Month', 'Name', 'Age', 'SSN', 'Occupation',
       'Annual_Income', 'Num_of_Loan', 'Type_of_Loan',
       'Num_of_Delayed_Payment', 'Changed_Credit_Limit', 'Credit_Mix',
       'Outstanding_Debt', 'Credit_History_Age', 'Payment_of_Min_Amount',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')

In [10]:
for col in object_col:
    print('Column Name: '+col)
    print("**"*20)
    print(data[col].value_counts(dropna=False))
    print('END', "--"*18, '\n')

Column Name: ID
****************************************
ID
0x1602     1
0x162e     1
0x25fea    1
0x25feb    1
0x25fec    1
          ..
0x13afa    1
0x13afb    1
0x13afc    1
0x13afd    1
0x25ff1    1
Name: count, Length: 150000, dtype: int64
END ------------------------------------

Column Name: Customer_ID
****************************************
Customer_ID
CUS_0xd40     12
CUS_0x9bf4    12
CUS_0x5ae3    12
CUS_0xbe9a    12
CUS_0x4874    12
              ..
CUS_0x2eb4    12
CUS_0x7863    12
CUS_0x9d89    12
CUS_0xc045    12
CUS_0x942c    12
Name: count, Length: 12500, dtype: int64
END ------------------------------------

Column Name: Month
****************************************
Month
January      12500
February     12500
March        12500
April        12500
May          12500
June         12500
July         12500
August       12500
September    12500
October      12500
November     12500
December     12500
Name: count, dtype: int64
END ------------------------------------

Column Name: Name
****************************************
Name
NaN                    15000
Stevex                    66
Langep                    65
Jessicad                  59
Raymondr                  58
                       ...
Carrick Mollenkampe        7
Giuseppeh                  7
Drivera                    7
Emi Emotor                 7
Timothyl                   6
Name: count, Length: 10140, dtype: int64
END ------------------------------------

Column Name: Age
****************************************
Age
39      4198
32      4189
28      4173
26      4140
35      4130
        ...
4655       1
529        1
8386       1
5924       1
5826       1
Name: count, Length: 2524, dtype: int64
END ------------------------------------

Column Name: SSN
****************************************
SSN
#F%$D@*&8      8400
078-73-5990      12
047-16-1543      12
255-39-8777      12
159-51-7992      12
               ...
414-76-9835       7
695-71-7676       7
803-44-6289       7
074-52-8105       7
642-73-7670       6
Name: count, Length: 12501, dtype: int64
END ------------------------------------

Column Name: Occupation
****************************************
Occupation
_______          10500
Lawyer            9899
Engineer          9562
Architect         9550
Mechanic          9459
Accountant        9404
Scientist         9403
Developer         9381
Media_Manager     9362
Teacher           9318
Entrepreneur      9277
Journalist        9122
Doctor            9114
Manager           8973
Musician          8858
Writer            8818
Name: count, dtype: int64
END ------------------------------------

Column Name: Annual_Income
****************************************
Annual_Income
36585.12      24
20867.67      23
17816.75      23
95596.35      23
9141.63       23
              ..
90370.96_      1
63528.7_       1
19470804.0     1
8092590.0      1
22620.79_      1
Name: count, Length: 21192, dtype: int64
END ------------------------------------

Column Name: Num_of_Loan
****************************************
Num_of_Loan
3        21500
2        21423
4        20998
0        15543
1        15112
         ...
291          1
365          1
1014         1
1129_        1
1296_        1
Name: count, Length: 623, dtype: int64
END ------------------------------------

Column Name: Type_of_Loan
****************************************
Type_of_Loan
NaN                                                                                                                                   17112
Not Specified                                                                                                                          2112
Credit-Builder Loan                                                                                                                    1920
Personal Loan                                                                                                                          1908
Debt Consolidation Loan                                                                                                                1896
                                                                                                                                      ...
Not Specified, Mortgage Loan, Auto Loan, and Payday Loan                                                                                 12
Payday Loan, Mortgage Loan, Debt Consolidation Loan, and Student Loan                                                                    12
Debt Consolidation Loan, Auto Loan, Personal Loan, Debt Consolidation Loan, Student Loan, and Credit-Builder Loan                        12
Student Loan, Auto Loan, Student Loan, Credit-Builder Loan, Home Equity Loan, Debt Consolidation Loan, and Debt Consolidation Loan       12
Personal Loan, Auto Loan, Mortgage Loan, Student Loan, and Student Loan                                                                  12
Name: count, Length: 6261, dtype: int64
END ------------------------------------

Column Name: Num_of_Delayed_Payment
****************************************
Num_of_Delayed_Payment
NaN     10500
19       7949
17       7806
16       7721
15       7671
        ...
2728        1
1952        1
3580        1
4251        1
2034        1
Name: count, Length: 1059, dtype: int64
END ------------------------------------

Column Name: Changed_Credit_Limit
****************************************
Changed_Credit_Limit
_        3150
11.5      197
11.32     189
8.22      189
7.35      181
         ...
34.57       1
31.94       1
34.46       1
23.32       1
29.17       1
Name: count, Length: 4605, dtype: int64
END ------------------------------------

Column Name: Credit_Mix
****************************************
Credit_Mix
Standard    54858
Good        36597
_           30000
Bad         28545
Name: count, dtype: int64
END ------------------------------------

Column Name: Outstanding_Debt
****************************************
Outstanding_Debt
1360.45     36
1151.7      35
460.46      35
1109.03     35
3628.5      24
            ..
1639.82_     1
1340.52_     1
647.15_      1
1959.49_     1
732.11_      1
Name: count, Length: 13622, dtype: int64
END ------------------------------------

Column Name: Credit_History_Age
****************************************
Credit_History_Age
NaN                       13500
17 Years and 11 Months      628
18 Years and 4 Months       621
18 Years and 3 Months       617
19 Years and 9 Months       615
                          ...
0 Years and 3 Months         20
0 Years and 2 Months         15
33 Years and 11 Months       15
34 Years and 0 Months        14
0 Years and 1 Months          2
Name: count, Length: 409, dtype: int64
END ------------------------------------

Column Name: Payment_of_Min_Amount
****************************************
Payment_of_Min_Amount
Yes    78484
No     53516
NM     18000
Name: count, dtype: int64
END ------------------------------------

Column Name: Amount_invested_monthly
****************************************
Amount_invested_monthly
NaN                   6750
__10000__             6480
0.0                    275
80.41529543900253        1
16.53218878920387        1
                      ...
209.17274569312266       1
333.0148085469461        1
274.68712877851107       1
220.58121173366908       1
220.45787812168732       1
Name: count, Length: 136498, dtype: int64
END ------------------------------------

Column Name: Payment_Behaviour
****************************************
Payment_Behaviour
Low_spent_Small_value_payments      38207
High_spent_Medium_value_payments    26462
Low_spent_Medium_value_payments     20698
High_spent_Large_value_payments     20565
High_spent_Small_value_payments     16991
Low_spent_Large_value_payments      15677
!@9#%8                              11400
Name: count, dtype: int64
END ------------------------------------

Column Name: Monthly_Balance
****************************************
Monthly_Balance
NaN                                 1762
__-333333333333333333333333333__      15
600.1125089726384                      1
120.54247208897846                     1
784.0174708573453                      1
                                    ...
279.9825060023594                      1
260.67157274114965                     1
250.4915113003876                      1
243.8753153006728                      1
360.37968260123847                     1
Name: count, Length: 148225, dtype: int64
END ------------------------------------

Column Name: Credit_Score
****************************************
Credit_Score
Standard    53174
NaN         50000
Poor        28998
Good        17828
Name: count, dtype: int64
END ------------------------------------

In [11]:
data.shape

(150000, 28)

In [12]:
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,0x25fe5,CUS_0x8600,December,Sarah McBridec,4975,031-35-0942,Architect,20002.88,1929.906667,10,...,_,3571.7,34.780553,NaN,Yes,60.964772,146.48632477751087,Low_spent_Small_value_payments,275.53956951573343,NaN
149996,0x25fee,CUS_0x942c,September,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,31 Years and 11 Months,NM,35.104023,181.44299902757518,Low_spent_Small_value_payments,409.39456169535066,NaN
149997,0x25fef,CUS_0x942c,October,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,32 Years and 0 Months,No,35.104023,__10000__,Low_spent_Large_value_payments,349.7263321025098,NaN
149998,0x25ff0,CUS_0x942c,November,Nicks,25,078-73-5990,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,32 Years and 1 Months,No,35.104023,97.59857973344877,High_spent_Small_value_payments,463.23898098947717,NaN
149999,0x25ff1,CUS_0x942c,December,Nicks,25,078-73-5990,Mechanic,39628.99,3359.415833,4,...,_,502.38,34.108530,32 Years and 2 Months,No,35.104023,220.45787812168732,Low_spent_Medium_value_payments,360.37968260123847,NaN

### Ganti Simbol aneh dengan NaN

In [13]:
def text_cleaning(val):
    # Jika nilainya NaN → biarkan tetap NaN
    if pd.isna(val):
        return np.nan
    # Jika string → bersihkan simbol-simbol tertentu
    if isinstance(val, str):
        return val.strip('_ ,"')
    # Jika bukan string (angka, float, dsb) → biarkan apa adanya
    return val

# --- Terapkan hanya ke kolom bertipe object/string ---
obj_cols = data.select_dtypes(include='object').columns

data[obj_cols] = data[obj_cols].apply(lambda col: col.map(text_cleaning))

# --- Ganti string aneh atau kosong dengan NaN ---
data[obj_cols] = data[obj_cols].replace(
    ['', 'nan', '!@9#%8', '#F%$D@*&8'],
    np.nan
)

data.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,NaN,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [14]:
data.isna().sum()

ID                              0
Customer_ID                     0
Month                           0
Name                        15000
Age                             0
SSN                          8400
Occupation                  10500
Annual_Income                   0
Monthly_Inhand_Salary       22500
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                17112
Delay_from_due_date             0
Num_of_Delayed_Payment      10500
Changed_Credit_Limit         3150
Num_Credit_Inquiries         3000
Credit_Mix                  30000
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age          13500
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      6750
Payment_Behaviour           11400
Monthly_Balance              1762
Credit_Score                50000
dtype: int64

fixing a data type

In [15]:
data.select_dtypes('O').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 20 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   ID                       150000 non-null  object
 1   Customer_ID              150000 non-null  object
 2   Month                    150000 non-null  object
 3   Name                     135000 non-null  object
 4   Age                      150000 non-null  object
 5   SSN                      141600 non-null  object
 6   Occupation               139500 non-null  object
 7   Annual_Income            150000 non-null  object
 8   Num_of_Loan              150000 non-null  object
 9   Type_of_Loan             132888 non-null  object
 10  Num_of_Delayed_Payment   139500 non-null  object
 11  Changed_Credit_Limit     146850 non-null  object
 12  Credit_Mix               120000 non-null  object
 13  Outstanding_Debt         150000 non-null  object
 14  Credit_History_Age       136500 non-null  object
 15  Payment_of_Min_Amount    150000 non-null  object
 16  Amount_invested_monthly  143250 non-null  object
 17  Payment_Behaviour        138600 non-null  object
 18  Monthly_Balance          148238 non-null  object
 19  Credit_Score             100000 non-null  object
dtypes: object(20)
memory usage: 22.9+ MB

In [16]:
def clean_and_transform(data: pd.DataFrame) -> pd.DataFrame:
    """
    Membersihkan dan mengonversi tipe data untuk kolom-kolom numerik & string tertentu.
    """
    data= data.copy()

    # ID & Customer_ID dari hex → int
    data['ID'] = data['ID'].apply(lambda x: int(x, 16) if isinstance(x, str) else np.nan)
    data['Customer_ID'] = data['Customer_ID'].apply(
        lambda x: int(x[4:], 16) if isinstance(x, str) and len(x) > 4 else np.nan
    )

    # Month "January" → 1..12
    data['Month'] = pd.to_datetime(data['Month'], format='%B', errors='coerce').dt.month

    # Age (nullable integer)
    data['Age'] = pd.to_numeric(data['Age'], errors='coerce').astype('Int64')

    # SSN: hapus '-' lalu ke float; tangani NaN
    data['SSN'] = data['SSN'].apply(
        lambda x: np.nan if pd.isna(x)
        else float(str(x).replace('-', '')) if isinstance(x, (str, int, float)) else np.nan
    )

    # Kolom numerik lain
    num_cols = [
        'Annual_Income', 'Num_of_Loan', 'Num_of_Delayed_Payment',
        'Changed_Credit_Limit', 'Outstanding_Debt',
        'Amount_invested_monthly', 'Monthly_Balance'
    ]
    for col in num_cols:
        data[col] = pd.to_numeric(data[col], errors='coerce')

    return data

data = clean_and_transform(data)
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,NaN,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,-500,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,155621,34304,12,Sarah McBridec,4975,31350942.0,Architect,20002.88,1929.906667,10,...,NaN,3571.70,34.780553,NaN,Yes,60.964772,146.486325,Low_spent_Small_value_payments,275.539570,NaN
149996,155630,37932,9,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,31 Years and 11 Months,NM,35.104023,181.442999,Low_spent_Small_value_payments,409.394562,NaN
149997,155631,37932,10,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,32 Years and 0 Months,No,35.104023,10000.000000,Low_spent_Large_value_payments,349.726332,NaN
149998,155632,37932,11,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,32 Years and 1 Months,No,35.104023,97.598580,High_spent_Small_value_payments,463.238981,NaN
149999,155633,37932,12,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,NaN,502.38,34.108530,32 Years and 2 Months,No,35.104023,220.457878,Low_spent_Medium_value_payments,360.379683,NaN

In [18]:
def preprocess_credit_and_loan(data: pd.DataFrame):
    data_out = data.copy()

    # 1) Konversi umur kredit ke bulan
    def Month_Converter(x):
        if pd.isna(x):
            return np.nan
        s = str(x).lower()
        try:
            s = s.replace('years','year').replace('months','month')
            parts = s.split()
            nums = [int(tok) for tok in parts if tok.isdigit()]
            if len(nums) >= 2:
                years, months = nums[0], nums[1]
                return float(years * 12 + months)
            if len(nums) == 1:
                return float(nums[0])
        except Exception:
            pass
        return np.nan

    if 'Credit_History_Age' in data_out.columns:
        data_out['Credit_History_Age'] = (
            data_out['Credit_History_Age'].apply(Month_Converter).astype(float)
        )

    # 2) Normalisasi Type_of_Loan
    if 'Type_of_Loan' in data_out.columns:
        data_out['Type_of_Loan'] = data_out['Type_of_Loan'].apply(
            lambda x: x.lower().replace('and ', '').replace(', ', ',').strip()
            if pd.notna(x) else x
        )

    # 3) Ekstraksi nilai unik Type_of_Loan — versi SESUAI KODE LAMA
    def get_Diff_Values_Colum(data_column, diff_value=[], sep=',', replace=''):
        column = data_column.dropna()
        for i in column:
            if sep not in i and i not in diff_value:
                diff_value.append(i)
            else:
                for data in map(lambda x:x.strip(), re.sub(replace, '', i).split(sep)):
                    if not data in diff_value:
                        diff_value.append(data)
        return dict(enumerate(sorted(diff_value)))

    loan_dict = {}
    if 'Type_of_Loan' in data_out.columns:
        loan_dict = get_Diff_Values_Colum(data_out['Type_of_Loan'])

    # Output tambahan (jaga kompatibel dengan rangkaian explorasi kamu)
    cha_by_customer_list = None
    tol_value_counts_head20 = None
    tol_counts_by_customer = None
    tol_by_customer_list = None

    if {'Customer_ID','Credit_History_Age'}.issubset(data_out.columns):
        cha_by_customer_list = data_out.groupby('Customer_ID')['Credit_History_Age'].apply(list)

    if 'Type_of_Loan' in data_out.columns:
        tol_value_counts_head20 = data_out['Type_of_Loan'].value_counts(dropna=False).head(20)
    if {'Customer_ID','Type_of_Loan'}.issubset(data_out.columns):
        tol_counts_by_customer = data_out.groupby('Customer_ID')['Type_of_Loan'].value_counts(dropna=False)
        tol_by_customer_list = data_out.groupby('Customer_ID')['Type_of_Loan'].apply(list)

    return (
        data_out,
        loan_dict,
        cha_by_customer_list,
        tol_value_counts_head20,
        tol_counts_by_customer,
        tol_by_customer_list,
    )
(
    data_processed,
    loan_dict,
    cha_by_cust_list,
    tol_vc_head20,
    tol_counts_by_cust,
    tol_by_cust_list
) = preprocess_credit_and_loan(data)

print("✅ Selesai preprocess.\n")
print("👉 data_processed.head():")
display(data_processed.head())

print("\n👉 Jumlah baris/kolom:", data_processed.shape)

if loan_dict:
    print("\n👉 loan_dict (contoh 20 teratas):")
    first_20 = dict(list(loan_dict.items())[:20])
    print(first_20)

if cha_by_cust_list is not None:
    print("\n👉 Credit_History_Age list per Customer_ID (head):")
    display(cha_by_cust_list.head())

if tol_vc_head20 is not None:
    print("\n👉 Type_of_Loan value_counts (top 20):")
    display(tol_vc_head20)

if tol_counts_by_cust is not None:
    print("\n👉 Type_of_Loan value_counts per Customer_ID (head):")
    display(tol_counts_by_cust.head())

if tol_by_cust_list is not None:
    print("\n👉 Type_of_Loan list per Customer_ID (head):")
    display(tol_by_cust_list.head())

# Jika ingin mengganti `data` asli:
data = data_processed

✅ Selesai preprocess.

👉 data_processed.head():

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,NaN,809.98,26.822620,265.0,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,-500,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,267.0,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,268.0,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,269.0,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good

👉 Jumlah baris/kolom: (150000, 28)

👉 loan_dict (contoh 20 teratas):
{0: 'auto loan', 1: 'credit-builder loan', 2: 'debt consolidation loan', 3: 'home equity loan', 4: 'mortgage loan', 5: 'not specified', 6: 'payday loan', 7: 'personal loan', 8: 'student loan'}

👉 Credit_History_Age list per Customer_ID (head):

Customer_ID
1006    [182.0, 183.0, 184.0, 185.0, 186.0, 187.0, 188...
1007    [346.0, 347.0, 348.0, 349.0, 350.0, nan, 352.0...
1008    [292.0, 293.0, 294.0, nan, 296.0, 297.0, 298.0...
1009    [331.0, 332.0, 333.0, 334.0, 335.0, 336.0, 337...
1011    [179.0, 180.0, nan, 182.0, 183.0, 184.0, 185.0...
Name: Credit_History_Age, dtype: object

👉 Type_of_Loan value_counts (top 20):

Type_of_Loan
NaN                                    17112
not specified                           2112
credit-builder loan                     1920
personal loan                           1908
debt consolidation loan                 1896
student loan                            1860
payday loan                             1800
mortgage loan                           1764
auto loan                               1728
home equity loan                        1704
personal loan,student loan               480
not specified,payday loan                408
mortgage loan,home equity loan           396
student loan,payday loan                 384
student loan,credit-builder loan         372
credit-builder loan,not specified        372
payday loan,debt consolidation loan      360
payday loan,auto loan                    360
mortgage loan,not specified              348
payday loan,personal loan                348
Name: count, dtype: int64

👉 Type_of_Loan value_counts per Customer_ID (head):

Customer_ID  Type_of_Loan
1006         credit-builder loan,payday loan                                12
1007         home equity loan,mortgage loan,student loan                    12
1008         NaN                                                            12
1009         credit-builder loan,student loan,not specified,student loan    12
1011         personal loan,auto loan,auto loan                              12
Name: count, dtype: int64

👉 Type_of_Loan list per Customer_ID (head):

Customer_ID
1006    [credit-builder loan,payday loan, credit-build...
1007    [home equity loan,mortgage loan,student loan, ...
1008    [nan, nan, nan, nan, nan, nan, nan, nan, nan, ...
1009    [credit-builder loan,student loan,not specifie...
1011    [personal loan,auto loan,auto loan, personal l...
Name: Type_of_Loan, dtype: object

In [19]:
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,NaN,809.98,26.822620,265.0,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,-500,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,267.0,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,268.0,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,269.0,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,155621,34304,12,Sarah McBridec,4975,31350942.0,Architect,20002.88,1929.906667,10,...,NaN,3571.70,34.780553,NaN,Yes,60.964772,146.486325,Low_spent_Small_value_payments,275.539570,NaN
149996,155630,37932,9,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,383.0,NM,35.104023,181.442999,Low_spent_Small_value_payments,409.394562,NaN
149997,155631,37932,10,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,384.0,No,35.104023,10000.000000,Low_spent_Large_value_payments,349.726332,NaN
149998,155632,37932,11,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,385.0,No,35.104023,97.598580,High_spent_Small_value_payments,463.238981,NaN
149999,155633,37932,12,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,NaN,502.38,34.108530,386.0,No,35.104023,220.457878,Low_spent_Medium_value_payments,360.379683,NaN

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        150000 non-null  int64
 1   Customer_ID               150000 non-null  int64
 2   Month                     150000 non-null  int32
 3   Name                      135000 non-null  object
 4   Age                       150000 non-null  Int64
 5   SSN                       141600 non-null  float64
 6   Occupation                139500 non-null  object
 7   Annual_Income             150000 non-null  float64
 8   Monthly_Inhand_Salary     127500 non-null  float64
 9   Num_Bank_Accounts         150000 non-null  int64
 10  Num_Credit_Card           150000 non-null  int64
 11  Interest_Rate             150000 non-null  int64
 12  Num_of_Loan               150000 non-null  int64
 13  Type_of_Loan              132888 non-null  object
 14  Delay_from_due_date       150000 non-null  int64
 15  Num_of_Delayed_Payment    139500 non-null  float64
 16  Changed_Credit_Limit      146850 non-null  float64
 17  Num_Credit_Inquiries      147000 non-null  float64
 18  Credit_Mix                120000 non-null  object
 19  Outstanding_Debt          150000 non-null  float64
 20  Credit_Utilization_Ratio  150000 non-null  float64
 21  Credit_History_Age        136500 non-null  float64
 22  Payment_of_Min_Amount     150000 non-null  object
 23  Total_EMI_per_month       150000 non-null  float64
 24  Amount_invested_monthly   143250 non-null  float64
 25  Payment_Behaviour         138600 non-null  object
 26  Monthly_Balance           148238 non-null  float64
 27  Credit_Score              100000 non-null  object
dtypes: Int64(1), float64(12), int32(1), int64(7), object(7)
memory usage: 31.6+ MB

In [21]:
data['Name'].value_counts(dropna=False).head()

Name
NaN         15000
Stevex         66
Langep         65
Jessicad       59
Johnc          58
Name: count, dtype: int64

In [22]:
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,NaN,809.98,26.822620,265.0,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,-500,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,267.0,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,268.0,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,269.0,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,155621,34304,12,Sarah McBridec,4975,31350942.0,Architect,20002.88,1929.906667,10,...,NaN,3571.70,34.780553,NaN,Yes,60.964772,146.486325,Low_spent_Small_value_payments,275.539570,NaN
149996,155630,37932,9,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,27.758522,383.0,NM,35.104023,181.442999,Low_spent_Small_value_payments,409.394562,NaN
149997,155631,37932,10,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,Good,502.38,36.858542,384.0,No,35.104023,10000.000000,Low_spent_Large_value_payments,349.726332,NaN
149998,155632,37932,11,Nicks,25,78735990.0,Mechanic,39628.99,NaN,4,...,Good,502.38,39.139840,385.0,No,35.104023,97.598580,High_spent_Small_value_payments,463.238981,NaN
149999,155633,37932,12,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4,...,NaN,502.38,34.108530,386.0,No,35.104023,220.457878,Low_spent_Medium_value_payments,360.379683,NaN

A. Object Column NaN Values: Reassign Group Mode Values¶

In [23]:
import numpy as np
import pandas as pd

# =============================================
# 1️⃣ FUNGSI: Isi NaN kolom object per grup dengan modus (mode)
# =============================================
def fill_object_nan_by_group_mode(
    data: pd.DataFrame,
    group_col: str,
    columns: list,
    *,
    inplace: bool = True,
    verbose: bool = True
) -> pd.DataFrame:
    """
    Mengisi nilai NaN/None pada kolom object per 'group_col'
    dengan modus (mode) dari grup tsb.

    Args:
        data        : DataFrame input
        group_col  : kolom pengelompok (mis. 'Customer_ID')
        columns    : daftar kolom object yang ingin dibersihkan
        inplace    : apakah hasil langsung ditulis ke data
        verbose    : tampilkan log sebelum/sesudah

    Returns:
        DataFrame hasil bersih
    """
    work = data if inplace else data.copy()

    for col in columns:
        if col not in work.columns:
            if verbose:
                print(f"⚠️ Kolom '{col}' tidak ditemukan — dilewati.")
            continue

        # Ganti None -> np.nan
        mask_none = work[col].isin([None])
        if mask_none.any():
            work.loc[mask_none, col] = np.nan

        # Info sebelum
        if verbose:
            n_nan_before = work[col].isna().sum()
            print(f"\n[{col}] NaN sebelum: {n_nan_before}")
            try:
                sample_before = work.groupby(group_col)[col].apply(list).head()
                print(f"[{col}] Contoh sebelum (5 grup):")
                for lst in sample_before.values:
                    print(lst)
            except Exception:
                pass

        # Hitung mode per grup
        mode_per_group = (
            work.groupby(group_col)[col]
                .transform(lambda s: s.mode().iloc[0] if not s.mode().empty else np.nan)
        )

        # Isi nilai kosong dengan mode
        work[col] = work[col].fillna(mode_per_group)

        # Info sesudah
        if verbose:
            n_nan_after = work[col].isna().sum()
            print(f"[{col}] NaN sesudah: {n_nan_after}")
            try:
                sample_after = work.groupby(group_col)[col].apply(list).head()
                print(f"[{col}] Contoh sesudah (5 grup):")
                for lst in sample_after.values:
                    print(lst)
            except Exception:
                pass

    return work


# =============================================
# 2️⃣ IMPLEMENTASI LANGSUNG KE DATA
# =============================================

# Ganti nilai NaN di Type_of_Loan jadi "No Data" (sesuai instruksi kamu)
if 'Type_of_Loan' in data.columns:
    data['Type_of_Loan'] = data['Type_of_Loan'].fillna('No Data')

# Jalankan pengisian NaN pada kolom-kolom object
data = fill_object_nan_by_group_mode(
    data,
    group_col='Customer_ID',
    columns=[
        'Name',
        'Occupation',
        'Credit_Mix',
        'Payment_Behaviour'
    ],
    inplace=True,
    verbose=True
)

# =============================================
# 3️⃣ TAMPILKAN HASIL
# =============================================

print("\n✅ Selesai mengisi NaN kolom object per grup dengan modus.")
print("👉 Data setelah pembersihan:")
display(data.head(10))  # tampilkan 10 baris pertama

print("\n📊 Ringkasan jumlah NaN per kolom:")
display(data.isna().sum().to_frame('Jumlah_NaN'))

print("\n📋 Tipe data setelah pembersihan:")
display(data.dtypes.to_frame('dtype'))

[Name] NaN sebelum: 15000
[Name] Contoh sebelum (5 grup):
['Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', nan, nan, 'Matthias Blamontb', nan, 'Matthias Blamontb']
[nan, 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', nan, nan, 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', nan, 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', nan, 'Koht', 'Koht', 'Koht', 'Koht']
['Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', nan]
['Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', nan, nan, 'Terry Wadeu', 'Terry Wadeu', nan]
[Name] NaN sesudah: 0
[Name] Contoh sesudah (5 grup):
['Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb', 'Matthias Blamontb']
['Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu', 'Soyoung Kimu']
['Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht', 'Koht']
['Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd', 'Edd']
['Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu', 'Terry Wadeu']

[Occupation] NaN sebelum: 10500
[Occupation] Contoh sebelum (5 grup):
['Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', nan, 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist']
['Manager', 'Manager', nan, 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer']
['Accountant', nan, 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', nan, 'Accountant', 'Accountant']
['Writer', 'Writer', 'Writer', 'Writer', nan, 'Writer', 'Writer', 'Writer', nan, 'Writer', 'Writer', 'Writer']
[Occupation] NaN sesudah: 0
[Occupation] Contoh sesudah (5 grup):
['Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist', 'Journalist']
['Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager']
['Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer', 'Developer']
['Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant', 'Accountant']
['Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer', 'Writer']

[Credit_Mix] NaN sebelum: 30000
[Credit_Mix] Contoh sebelum (5 grup):
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
[nan, 'Standard', 'Standard', 'Standard', nan, 'Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
[nan, 'Standard', 'Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', nan, 'Standard', 'Standard']
[nan, nan, 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
[Credit_Mix] NaN sesudah: 0
[Credit_Mix] Contoh sesudah (5 grup):
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']
['Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard', 'Standard']

[Payment_Behaviour] NaN sebelum: 11400
[Payment_Behaviour] Contoh sebelum (5 grup):
['High_spent_Medium_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', nan, 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', nan, 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Large_value_payments', 'High_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', nan, 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Medium_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', nan]
[Payment_Behaviour] NaN sesudah: 0
[Payment_Behaviour] Contoh sesudah (5 grup):
['High_spent_Medium_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'Low_spent_Small_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Large_value_payments', 'High_spent_Small_value_payments', 'High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments']
['High_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'High_spent_Medium_value_payments', 'High_spent_Medium_value_payments']
['High_spent_Small_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Small_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'Low_spent_Large_value_payments', 'Low_spent_Medium_value_payments', 'High_spent_Large_value_payments', 'Low_spent_Medium_value_payments']

✅ Selesai mengisi NaN kolom object per grup dengan modus.
👉 Data setelah pembersihan:

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,26.822620,265.0,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,-500,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,267.0,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,268.0,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,269.0,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good
5,5639,3392,6,Aaron Maashoh,23,821000265.0,Scientist,19114.12,NaN,3,...,Good,809.98,27.262259,270.0,No,49.574949,62.430172,High_spent_Medium_value_payments,340.479212,Good
6,5640,3392,7,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3,...,Good,809.98,22.537593,271.0,No,49.574949,178.344067,Low_spent_Small_value_payments,244.565317,Good
7,5641,3392,8,Aaron Maashoh,23,NaN,Scientist,19114.12,1824.843333,3,...,Good,809.98,23.933795,NaN,No,49.574949,24.785217,High_spent_Medium_value_payments,358.124168,Standard
8,5646,8625,1,Rick Rothackerj,28,4075839.0,Teacher,34847.84,3037.986667,2,...,Good,605.03,24.464031,319.0,No,18.816215,104.291825,Low_spent_Small_value_payments,470.690627,Standard
9,5647,8625,2,Rick Rothackerj,28,4075839.0,Teacher,34847.84,3037.986667,2,...,Good,605.03,38.550848,320.0,No,18.816215,40.391238,High_spent_Large_value_payments,484.591214,Good

📊 Ringkasan jumlah NaN per kolom:

                          Jumlah_NaN
ID                                 0
Customer_ID                        0
Month                              0
Name                               0
Age                                0
SSN                             8400
Occupation                         0
Annual_Income                      0
Monthly_Inhand_Salary          22500
Num_Bank_Accounts                  0
Num_Credit_Card                    0
Interest_Rate                      0
Num_of_Loan                        0
Type_of_Loan                       0
Delay_from_due_date                0
Num_of_Delayed_Payment         10500
Changed_Credit_Limit            3150
Num_Credit_Inquiries            3000
Credit_Mix                         0
Outstanding_Debt                   0
Credit_Utilization_Ratio           0
Credit_History_Age             13500
Payment_of_Min_Amount              0
Total_EMI_per_month                0
Amount_invested_monthly         6750
Payment_Behaviour                  0
Monthly_Balance                 1762
Credit_Score                   50000

📋 Tipe data setelah pembersihan:

                            dtype
ID                          int64
Customer_ID                 int64
Month                       int32
Name                       object
Age                         Int64
SSN                       float64
Occupation                 object
Annual_Income             float64
Monthly_Inhand_Salary     float64
Num_Bank_Accounts           int64
Num_Credit_Card             int64
Interest_Rate               int64
Num_of_Loan                 int64
Type_of_Loan               object
Delay_from_due_date         int64
Num_of_Delayed_Payment    float64
Changed_Credit_Limit      float64
Num_Credit_Inquiries      float64
Credit_Mix                 object
Outstanding_Debt          float64
Credit_Utilization_Ratio  float64
Credit_History_Age        float64
Payment_of_Min_Amount      object
Total_EMI_per_month       float64
Amount_invested_monthly   float64
Payment_Behaviour          object
Monthly_Balance           float64
Credit_Score               object

In [24]:
import numpy as np
import pandas as pd

def Numeric_Wrong_Values_Reassign_Group_Min_Max(data, groupby, column, inplace=True):
    """
    Bersihkan nilai numerik di 'column' per 'groupby':
      - Tentukan range min–max (berdasarkan mode per-grup → fallback quantile 5–95 → min/max global → 0/0)
      - Nilai di luar range -> NaN
      - Imput NaN: mode per-grup -> median per-grup -> median global -> 0
    """
    work = data if inplace else data.copy()
    work[column] = pd.to_numeric(work[column], errors='coerce')

    # 1) Hitung range min–max dari mode per-grup
    cur = (
        work.loc[work[column].notna()]
            .groupby(groupby)[column]
            .apply(list)
    )
    if len(cur) > 0:
        # ambil satu nilai mode per grup (jika multi-mode, ambil yang pertama)
        mode_vals = []
        for vals in cur:
            m = pd.Series(vals).mode()
            if not m.empty:
                mode_vals.append(m.iloc[0])
        if len(mode_vals) > 0:
            mini, maxi = float(np.min(mode_vals)), float(np.max(mode_vals))
        else:
            mini = maxi = np.nan
    else:
        mini = maxi = np.nan

    # Fallback range jika belum valid
    s_non_na = work[column].dropna()
    if (not np.isfinite(mini)) or (not np.isfinite(maxi)):
        if not s_non_na.empty:
            mini = float(s_non_na.quantile(0.05))
            maxi = float(s_non_na.quantile(0.95))
        else:
            mini = maxi = 0.0
    if mini > maxi and not s_non_na.empty:
        mini, maxi = float(s_non_na.min()), float(s_non_na.max())

    print(f"\n[{column}] Range min–max yang digunakan: ({mini}, {maxi})")

    # 2) Tandai out-of-range menjadi NaN
    marked = work[column].where(~((work[column] < mini) | (work[column] > maxi)), np.nan)

    # 3) Imput NaN berjenjang
    # 3.1 mode per-grup
    mode_by_group = work.groupby(groupby)[column].transform(
        lambda x: x.mode()[0] if not x.mode().empty else np.nan
    )
    result = marked.fillna(mode_by_group)

    # 3.2 median per-grup
    if result.isna().any():
        median_by_group = work.groupby(groupby)[column].transform(lambda x: x.median())
        result = result.fillna(median_by_group)

    # 3.3 median global
    if result.isna().any():
        global_med = work[column].median()
        if pd.isna(global_med):
            global_med = 0.0
        result = result.fillna(global_med)

    # 3.4 sisa → 0
    result = result.fillna(0.0)

    # 4) Assign
    if inplace:
        work[column] = result
        print(f"✅ {column} selesai diproses. Sisa NaN: {work[column].isna().sum()}")
        return work
    else:
        print(f"✅ {column} selesai diproses (return Series).")
        return result


def clean_numeric_columns(data, group_col='Customer_ID', inplace=True):
    """
    Membersihkan kolom numerik umum + interpolasi Credit_History_Age per group.
    Menggunakan Numeric_Wrong_Values_Reassign_Group_Min_Max untuk tiap kolom.
    """
    numeric_cols = [
        'Age',
        'SSN',
        'Annual_Income',
        'Monthly_Inhand_Salary',
        'Num_Bank_Accounts',
        'Num_Credit_Card',
        'Interest_Rate',
        'Num_of_Loan',
        'Delay_from_due_date',
        'Num_of_Delayed_Payment',
        'Changed_Credit_Limit',
        'Num_Credit_Inquiries',
        'Outstanding_Debt',
        'Total_EMI_per_month',
        'Amount_invested_monthly',
        'Monthly_Balance'
    ]

    work = data if inplace else data.copy()

    for col in numeric_cols:
        if col in work.columns:
            print(f"\n==================== Cleaning: {col} ====================")
            Numeric_Wrong_Values_Reassign_Group_Min_Max(
                work, group_col, col, inplace=True
            )

    # Interpolasi Credit_History_Age per group (gunakan transform agar index align)
    if 'Credit_History_Age' in work.columns:
        print("\nInterpolating Credit_History_Age ...")
        work['Credit_History_Age'] = (
            pd.to_numeric(work['Credit_History_Age'], errors='coerce')
              .groupby(work[group_col])
              .transform(lambda s: s.interpolate().bfill().ffill())
        )

    print("\n✅ Semua kolom numerik selesai dibersihkan.")
    return work

In [25]:
data = clean_numeric_columns(data, group_col='Customer_ID', inplace=True)

==================== Cleaning: Age ====================

[Age] Range min–max yang digunakan: (14.0, 56.0)
✅ Age selesai diproses. Sisa NaN: 0

==================== Cleaning: SSN ====================

[SSN] Range min–max yang digunakan: (81349.0, 999993421.0)
✅ SSN selesai diproses. Sisa NaN: 0

==================== Cleaning: Annual_Income ====================

[Annual_Income] Range min–max yang digunakan: (7005.93, 179987.28)
✅ Annual_Income selesai diproses. Sisa NaN: 0

==================== Cleaning: Monthly_Inhand_Salary ====================

[Monthly_Inhand_Salary] Range min–max yang digunakan: (303.6454166666666, 15204.633333333331)
✅ Monthly_Inhand_Salary selesai diproses. Sisa NaN: 0

==================== Cleaning: Num_Bank_Accounts ====================

[Num_Bank_Accounts] Range min–max yang digunakan: (-1.0, 11.0)
✅ Num_Bank_Accounts selesai diproses. Sisa NaN: 0

==================== Cleaning: Num_Credit_Card ====================

[Num_Credit_Card] Range min–max yang digunakan: (0.0, 11.0)
✅ Num_Credit_Card selesai diproses. Sisa NaN: 0

==================== Cleaning: Interest_Rate ====================

[Interest_Rate] Range min–max yang digunakan: (1.0, 34.0)
✅ Interest_Rate selesai diproses. Sisa NaN: 0

==================== Cleaning: Num_of_Loan ====================

[Num_of_Loan] Range min–max yang digunakan: (0.0, 9.0)
✅ Num_of_Loan selesai diproses. Sisa NaN: 0

==================== Cleaning: Delay_from_due_date ====================

[Delay_from_due_date] Range min–max yang digunakan: (-1.0, 62.0)
✅ Delay_from_due_date selesai diproses. Sisa NaN: 0

==================== Cleaning: Num_of_Delayed_Payment ====================

[Num_of_Delayed_Payment] Range min–max yang digunakan: (-2.0, 25.0)
✅ Num_of_Delayed_Payment selesai diproses. Sisa NaN: 0

==================== Cleaning: Changed_Credit_Limit ====================

[Changed_Credit_Limit] Range min–max yang digunakan: (0.5, 29.98)
✅ Changed_Credit_Limit selesai diproses. Sisa NaN: 0

==================== Cleaning: Num_Credit_Inquiries ====================

[Num_Credit_Inquiries] Range min–max yang digunakan: (0.0, 17.0)
✅ Num_Credit_Inquiries selesai diproses. Sisa NaN: 0

==================== Cleaning: Outstanding_Debt ====================

[Outstanding_Debt] Range min–max yang digunakan: (0.23, 4998.07)
✅ Outstanding_Debt selesai diproses. Sisa NaN: 0

==================== Cleaning: Total_EMI_per_month ====================

[Total_EMI_per_month] Range min–max yang digunakan: (0.0, 1779.1032538262775)
✅ Total_EMI_per_month selesai diproses. Sisa NaN: 0

==================== Cleaning: Amount_invested_monthly ====================

[Amount_invested_monthly] Range min–max yang digunakan: (0.0, 10000.0)
✅ Amount_invested_monthly selesai diproses. Sisa NaN: 0

==================== Cleaning: Monthly_Balance ====================

[Monthly_Balance] Range min–max yang digunakan: (-3.333333333333333e+26, 1183.9306960885192)
✅ Monthly_Balance selesai diproses. Sisa NaN: 0

Interpolating Credit_History_Age ...

✅ Semua kolom numerik selesai dibersihkan.

In [26]:
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,26.822620,265.0,No,49.574949,80.415295,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,31.944960,266.0,No,49.574949,118.280222,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,28.609352,267.0,No,49.574949,81.699521,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,31.377862,268.0,No,49.574949,199.458074,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,24.797347,269.0,No,49.574949,41.420153,High_spent_Medium_value_payments,341.489231,Good
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,155621,34304,12,Sarah McBridec,28,31350942.0,Architect,20002.88,1929.906667,10.0,...,Bad,3571.70,34.780553,78.0,Yes,60.964772,146.486325,Low_spent_Small_value_payments,275.539570,NaN
149996,155630,37932,9,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,Good,502.38,27.758522,383.0,NM,35.104023,181.442999,Low_spent_Small_value_payments,409.394562,NaN
149997,155631,37932,10,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,Good,502.38,36.858542,384.0,No,35.104023,10000.000000,Low_spent_Large_value_payments,349.726332,NaN
149998,155632,37932,11,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,Good,502.38,39.139840,385.0,No,35.104023,97.598580,High_spent_Small_value_payments,463.238981,NaN
149999,155633,37932,12,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,Good,502.38,34.108530,386.0,No,35.104023,220.457878,Low_spent_Medium_value_payments,360.379683,NaN

In [27]:
data.isna().sum()

ID                              0
Customer_ID                     0
Month                           0
Name                            0
Age                             0
SSN                             0
Occupation                      0
Annual_Income                   0
Monthly_Inhand_Salary           0
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                    0
Delay_from_due_date             0
Num_of_Delayed_Payment          0
Changed_Credit_Limit            0
Num_Credit_Inquiries            0
Credit_Mix                      0
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age              0
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly         0
Payment_Behaviour               0
Monthly_Balance                 0
Credit_Score                50000
dtype: int64

### Fixing Anomalies

- Num_Bank_Accounts,
- Delay_from_due_date,
- Num_of_Delayed_Payment,
- Monthly_Balance have negative strange number
- Amount_invested_monthly have positive strange number

In [28]:
import numpy as np
import pandas as pd

def fix_strange_values(data: pd.DataFrame, group_col: str = 'Customer_ID', inplace: bool = True) -> pd.DataFrame:
    """
    Perbaiki nilai 'strange' sesuai instruksi:
      - Num_Bank_Accounts < 0 -> 0
      - Delay_from_due_date < 0 -> NaN -> perbaiki dengan Numeric_Wrong_Values_Reassign_Group_Min_Max
      - Num_of_Delayed_Payment < 0 -> NaN -> perbaiki dengan Numeric_Wrong_Values_Reassign_Group_Min_Max
      - Monthly_Balance < 0 -> NaN -> perbaiki dengan Numeric_Wrong_Values_Reassign_Group_Min_Max
      - Amount_invested_monthly >= 10000 -> NaN -> isi mode per group
    """
    work = data if inplace else data.copy()

    # Num_Bank_Accounts
    if 'Num_Bank_Accounts' in work.columns:
        work.loc[work['Num_Bank_Accounts'] < 0, 'Num_Bank_Accounts'] = 0
        print("✅ Num_Bank_Accounts negatif diganti 0")

    # Delay_from_due_date
    if 'Delay_from_due_date' in work.columns:
        work.loc[work['Delay_from_due_date'] < 0, 'Delay_from_due_date'] = np.nan
        Numeric_Wrong_Values_Reassign_Group_Min_Max(work, group_col, 'Delay_from_due_date', inplace=True)
        print("✅ Delay_from_due_date negatif dibersihkan & diisi ulang (per group)")

    # Num_of_Delayed_Payment
    if 'Num_of_Delayed_Payment' in work.columns:
        work.loc[work['Num_of_Delayed_Payment'] < 0, 'Num_of_Delayed_Payment'] = np.nan
        Numeric_Wrong_Values_Reassign_Group_Min_Max(work, group_col, 'Num_of_Delayed_Payment', inplace=True)
        print("✅ Num_of_Delayed_Payment negatif dibersihkan & diisi ulang (per group)")

    # Monthly_Balance
    if 'Monthly_Balance' in work.columns:
        work.loc[work['Monthly_Balance'] < 0, 'Monthly_Balance'] = np.nan
        Numeric_Wrong_Values_Reassign_Group_Min_Max(work, group_col, 'Monthly_Balance', inplace=True)
        print("✅ Monthly_Balance negatif dibersihkan & diisi ulang (per group)")

    # Amount_invested_monthly
    if 'Amount_invested_monthly' in work.columns:
        work.loc[work['Amount_invested_monthly'] >= 10000, 'Amount_invested_monthly'] = np.nan
        work['Amount_invested_monthly'] = work.groupby(group_col)['Amount_invested_monthly'].transform(
            lambda x: x.mode()[0] if not x.mode().empty else np.nan
        )
        print("✅ Amount_invested_monthly outlier >10000 dibersihkan & diisi mode per group")

    return work


# ======== IMPLEMENTASI LANGSUNG ========

data = fix_strange_values(data, group_col='Customer_ID', inplace=True)

print("\n✅ Semua nilai aneh sudah diperbaiki.")
display(data.head(10))

✅ Num_Bank_Accounts negatif diganti 0

[Delay_from_due_date] Range min–max yang digunakan: (0.0, 62.0)
✅ Delay_from_due_date selesai diproses. Sisa NaN: 0
✅ Delay_from_due_date negatif dibersihkan & diisi ulang (per group)

[Num_of_Delayed_Payment] Range min–max yang digunakan: (0.0, 25.0)
✅ Num_of_Delayed_Payment selesai diproses. Sisa NaN: 0
✅ Num_of_Delayed_Payment negatif dibersihkan & diisi ulang (per group)

[Monthly_Balance] Range min–max yang digunakan: (0.0077596647753352, 1183.9306960885192)
✅ Monthly_Balance selesai diproses. Sisa NaN: 0
✅ Monthly_Balance negatif dibersihkan & diisi ulang (per group)
✅ Amount_invested_monthly outlier >10000 dibersihkan & diisi mode per group

✅ Semua nilai aneh sudah diperbaiki.

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,26.822620,265.0,No,49.574949,21.465380,High_spent_Small_value_payments,312.494089,Good
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,31.944960,266.0,No,49.574949,21.465380,Low_spent_Large_value_payments,284.629162,Good
2,5636,3392,3,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,28.609352,267.0,No,49.574949,21.465380,Low_spent_Medium_value_payments,331.209863,Good
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,31.377862,268.0,No,49.574949,21.465380,Low_spent_Small_value_payments,223.451310,Good
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,24.797347,269.0,No,49.574949,21.465380,High_spent_Medium_value_payments,341.489231,Good
5,5639,3392,6,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,27.262259,270.0,No,49.574949,21.465380,High_spent_Medium_value_payments,340.479212,Good
6,5640,3392,7,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,22.537593,271.0,No,49.574949,21.465380,Low_spent_Small_value_payments,244.565317,Good
7,5641,3392,8,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,Good,809.98,23.933795,272.0,No,49.574949,21.465380,High_spent_Medium_value_payments,358.124168,Standard
8,5646,8625,1,Rick Rothackerj,28,4075839.0,Teacher,34847.84,3037.986667,2.0,...,Good,605.03,24.464031,319.0,No,18.816215,39.684018,Low_spent_Small_value_payments,470.690627,Standard
9,5647,8625,2,Rick Rothackerj,28,4075839.0,Teacher,34847.84,3037.986667,2.0,...,Good,605.03,38.550848,320.0,No,18.816215,39.684018,High_spent_Large_value_payments,484.591214,Good

## Assign Categorical Types to Numeric Types

In [30]:
def encode_categorical_columns(data: pd.DataFrame, columns: list = None, suffix: str = "_Num") -> pd.DataFrame:
    """
    Mengonversi kolom kategorikal menjadi kode numerik (category codes).
    - Secara default mengenali kolom kategorikal umum dari dataset kredit.
    - Otomatis buat kolom baru dengan suffix (default: '_Num').
    """
    work = data.copy()

    # Kolom default (bisa disesuaikan)
    if columns is None:
        columns = [
            'Occupation', 'Credit_Mix',
            'Payment_of_Min_Amount', 'Payment_Behaviour'
        ]

    for col in columns:
        if col in work.columns:
            new_col = f"{col}{suffix}"
            work[new_col] = (
                work[col]
                .astype('category')
                .cat.codes
                .replace(-1, np.nan)   # -1 artinya NaN di pandas category
            )
        else:
            print(f"Kolom '{col}' tidak ditemukan, dilewati.")

    return work

data = encode_categorical_columns(data)
data

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score,Occupation_Num,Credit_Mix_Num,Payment_of_Min_Amount_Num,Payment_Behaviour_Num
0,5634,3392,1,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,No,49.574949,21.465380,High_spent_Small_value_payments,312.494089,Good,12,1,1,2
1,5635,3392,2,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,No,49.574949,21.465380,Low_spent_Large_value_payments,284.629162,Good,12,1,1,3
2,5636,3392,3,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,No,49.574949,21.465380,Low_spent_Medium_value_payments,331.209863,Good,12,1,1,4
3,5637,3392,4,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,No,49.574949,21.465380,Low_spent_Small_value_payments,223.451310,Good,12,1,1,5
4,5638,3392,5,Aaron Maashoh,23,821000265.0,Scientist,19114.12,1824.843333,3.0,...,No,49.574949,21.465380,High_spent_Medium_value_payments,341.489231,Good,12,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
149995,155621,34304,12,Sarah McBridec,28,31350942.0,Architect,20002.88,1929.906667,10.0,...,Yes,60.964772,34.662906,Low_spent_Small_value_payments,275.539570,NaN,1,0,2,5
149996,155630,37932,9,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,NM,35.104023,24.028477,Low_spent_Small_value_payments,409.394562,NaN,9,1,0,5
149997,155631,37932,10,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,No,35.104023,24.028477,Low_spent_Large_value_payments,349.726332,NaN,9,1,1,3
149998,155632,37932,11,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,No,35.104023,24.028477,High_spent_Small_value_payments,463.238981,NaN,9,1,1,2
149999,155633,37932,12,Nicks,25,78735990.0,Mechanic,39628.99,3359.415833,4.0,...,No,35.104023,24.028477,Low_spent_Medium_value_payments,360.379683,NaN,9,1,1,4

In [ ]:
data[data['Credit_Score'].notna()].to_csv("./data_baru/preprocessed_train.csv", index=False)
data[data['Credit_Score'].isna()].drop(columns='Credit_Score').to_csv("./data_baru/preprocessed_test.csv", index=False)